In [1]:
import pandas as pd

In [2]:
titanic=pd.read_csv('titanic.txt')

In [3]:
titanic.head()

,row.names,pclass,survived,name,age,embarked,home.dest,room,ticket,boat,sex
0,1,1st,1,"Allen, Miss Elisabeth Walton",29.0000,Southampton,"St Louis, MO",B-5,24160 L221,2,female
1,2,1st,0,"Allison, Miss Helen Loraine",2.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,NaN,female
2,3,1st,0,"Allison, Mr Hudson Joshua Creighton",30.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,(135),male
3,4,1st,0,"Allison, Mrs Hudson J.C. (Bessie Waldo Daniels)",25.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,NaN,female
4,5,1st,1,"Allison, Master Hudson Trevor",0.9167,Southampton,"Montreal, PQ / Chesterville, ON",C22,NaN,11,male

In [4]:
titanic.tail()

,row.names,pclass,survived,name,age,embarked,home.dest,room,ticket,boat,sex
1308,1309,3rd,0,"Zakarian, Mr Artun",NaN,NaN,NaN,NaN,NaN,NaN,male
1309,1310,3rd,0,"Zakarian, Mr Maprieder",NaN,NaN,NaN,NaN,NaN,NaN,male
1310,1311,3rd,0,"Zenn, Mr Philip",NaN,NaN,NaN,NaN,NaN,NaN,male
1311,1312,3rd,0,"Zievens, Rene",NaN,NaN,NaN,NaN,NaN,NaN,female
1312,1313,3rd,0,"Zimmerman, Leo",NaN,NaN,NaN,NaN,NaN,NaN,male

In [5]:
titanic.describe(include='all')

,row.names,pclass,survived,name,age,embarked,home.dest,room,ticket,boat,sex
count,1313.000000,1313,1313.000000,1313,633.000000,821,754,77,69,347,1313
unique,NaN,3,NaN,1310,NaN,3,371,53,41,99,2
top,NaN,3rd,NaN,"Kelly, Mr James",NaN,Southampton,"New York, NY",F-33,17608 L262 7s 6d,4,male
freq,NaN,711,NaN,2,NaN,573,65,4,5,27,850
mean,657.000000,NaN,0.341965,NaN,31.194181,NaN,NaN,NaN,NaN,NaN,NaN
std,379.174762,NaN,0.474549,NaN,14.747525,NaN,NaN,NaN,NaN,NaN,NaN
min,1.000000,NaN,0.000000,NaN,0.166700,NaN,NaN,NaN,NaN,NaN,NaN
25%,329.000000,NaN,0.000000,NaN,21.000000,NaN,NaN,NaN,NaN,NaN,NaN
50%,657.000000,NaN,0.000000,NaN,30.000000,NaN,NaN,NaN,NaN,NaN,NaN
75%,985.000000,NaN,1.000000,NaN,41.000000,NaN,NaN,NaN,NaN,NaN,NaN
max,1313.000000,NaN,1.000000,NaN,71.000000,NaN,NaN,NaN,NaN,NaN,NaN

In [6]:
titanic['age']=titanic['age'].fillna(titanic['age'].mean())

In [7]:
titanic['age'].describe()

count    1313.000000
mean       31.194181
std        10.235540
min         0.166700
25%        30.000000
50%        31.194181
75%        31.194181
max        71.000000
Name: age, dtype: float64

In [8]:
titanic.dtypes

row.names      int64
pclass        object
survived       int64
name          object
age          float64
embarked      object
home.dest     object
room          object
ticket        object
boat          object
sex           object
dtype: object

In [9]:
print(titanic['sex'].unique())

['female' 'male']

In [10]:
print(titanic['pclass'].unique())

['1st' '2nd' '3rd']

In [11]:
print(titanic['age'].unique())

[ 29.           2.          30.          25.           0.9167      47.          63.
  39.          58.          71.          19.          31.19418104  50.          24.
  36.          37.          26.          28.          45.          22.          41.
  48.          44.          59.          60.          53.          33.          14.
  11.          49.          46.          27.          31.          64.          55.
  70.          69.          38.          17.           4.          23.          35.
  54.          21.          52.          16.          51.          42.          40.
  15.          65.          18.          56.          43.          61.          13.
  34.           6.          57.          32.          62.          67.          20.
   1.          12.           0.8333       8.           7.           3.           9.
   5.           0.3333       0.1667      10.        ]

In [12]:
print(titanic['survived'].unique())

[1 0]

In [13]:
titanic['sex']=titanic['sex'].map({'female':1,'male':0}).astype(int)

In [14]:
titanic['pclass']=titanic['pclass'].map({'1st':1,'2nd':2,'3rd':3}).astype(int)

In [15]:
titanic.dtypes

row.names      int64
pclass         int32
survived       int64
name          object
age          float64
embarked      object
home.dest     object
room          object
ticket        object
boat          object
sex            int32
dtype: object

In [16]:
titanic['age'].astype(int)

0       29
1        2
2       30
3       25
4        0
5       47
6       63
7       39
8       58
9       71
10      47
11      19
12      31
13      31
14      31
15      50
16      24
17      36
18      37
19      47
20      26
21      25
22      25
23      19
24      28
25      45
26      39
27      30
28      58
29      31
        ..
1283    31
1284    31
1285    31
1286    31
1287    31
1288    31
1289    31
1290    31
1291    31
1292    31
1293    31
1294    31
1295    31
1296    31
1297    31
1298    31
1299    31
1300    31
1301    31
1302    31
1303    31
1304    31
1305    31
1306    31
1307    31
1308    31
1309    31
1310    31
1311    31
1312    31
Name: age, Length: 1313, dtype: int32

In [17]:
x=titanic[['pclass','age','sex']]

In [19]:
y=titanic['survived']

In [20]:
x.describe()

            pclass          age          sex
count  1313.000000  1313.000000  1313.000000
mean      2.296268    31.194181     0.352628
std       0.836365    10.235540     0.477970
min       1.000000     0.166700     0.000000
25%       2.000000    30.000000     0.000000
50%       3.000000    31.194181     0.000000
75%       3.000000    31.194181     1.000000
max       3.000000    71.000000     1.000000

In [21]:
y.describe()

count    1313.000000
mean        0.341965
std         0.474549
min         0.000000
25%         0.000000
50%         0.000000
75%         1.000000
max         1.000000
Name: survived, dtype: float64

In [24]:
from sklearn.model_selection import train_test_split

In [25]:
x_train,x_test,y_train,y_test=train_test_split(x,y)

In [26]:
x_train.describe()

           pclass         age         sex
count  984.000000  984.000000  984.000000
mean     2.324187   31.102533    0.364837
std      0.824093   10.336566    0.481629
min      1.000000    0.166700    0.000000
25%      2.000000   30.000000    0.000000
50%      3.000000   31.194181    0.000000
75%      3.000000   31.194181    1.000000
max      3.000000   71.000000    1.000000

In [27]:
x_test.describe()

           pclass         age         sex
count  329.000000  329.000000  329.000000
mean     2.212766   31.468290    0.316109
std      0.867971    9.937632    0.465664
min      1.000000    0.833300    0.000000
25%      1.000000   30.000000    0.000000
50%      3.000000   31.194181    0.000000
75%      3.000000   31.194181    1.000000
max      3.000000   71.000000    1.000000

In [28]:
from sklearn.metrics import classification_report

In [29]:
from sklearn import tree

In [30]:
clf=tree.DecisionTreeClassifier()

In [31]:
clf=clf.fit(x_train,y_train)

In [32]:
test_predict=clf.predict(x_test)

In [33]:
print(classification_report(y_test,test_predict))

             precision    recall  f1-score   support

          0       0.82      0.90      0.86       225
          1       0.72      0.56      0.63       104

avg / total       0.79      0.79      0.79       329

In [34]:
from sklearn.externals.six import StringIO
with open('credit.dot','w') as f:
    f=tree.export_graphviz(clf,out_file=f)